app/views/pages/about.html.erb

    <div class="comment">
      <% @random_comment = Comment.all.shuffle.last %>
---
SELECT "comments".* FROM "comments"