app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "logo_file_name", "logo_content_type", "logo_file_size", "logo_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save