app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "123"], ["url", "123.ru"], ["created_at", "2016-08-15 18:32:31.331441"], ["updated_at", "2016-08-15 18:32:31.331441"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "picture_file_name" = ?, "picture_content_type" = ?, "picture_file_size" = ?, "picture_updated_at" = ?, "updated_at" = ? WHERE "projects"."id" = ?
---
  def update
    respond_to do |format|
      if @project.update(project_params)